# SQL II: Grouping and Joining

_May 18, 2020_

Agenda:
- Practice with Grouping in SQLite
- Practice with different types of Joins in SQLite

<img src = "https://media.giphy.com/media/3oKIPnAiaMCws8nOsE/giphy.gif">

In [15]:
import sqlite3
import pandas as pd
import seaborn as sns
import numpy as np

## Part I. Grouping
Just like pandas, Sql support different types of grouping statements for performing aggregate functions and allow us to calculate various statistics for data.

Syntax:
`SELECT * FROM tables GROUP BY column`

In [16]:
# instantiate some data
auto = pd.read_csv('auto-mpg.csv')
tips = sns.load_dataset('tips')
small_quiz = pd.DataFrame({"students":["Muriel","JP","Danny"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_grades = pd.DataFrame({"students":["Kevin","JP","Dipta"],
                            "quiz_score":np.random.randint(0,10,3)})

In [17]:
conn = sqlite3.connect('aggregate.db')
c = conn.cursor()

In [18]:
# insert these datasets into our db
auto.to_sql('auto', con=conn)
tips.to_sql('tips', con=conn)
small_grades.to_sql('small_grade', con=conn)
small_quiz.to_sql('small_quiz',con=conn)

/opt/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:2663: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [19]:
# for the tips df/table, get the total number of man and woman who tips
tips.groupby('sex').sex.value_counts()

sex     sex
Male    Male      157
Female  Female     87
Name: sex, dtype: int64

In [20]:
# in sql 
query = """SELECT sex, COUNT(*) FROM tips GROUP BY sex"""
c.execute(query).fetchall()

[('Female', 87), ('Male', 157)]

In [21]:
# using pandas, select the average amount tipped for time
tips.groupby('time').tip.mean()

time
Lunch     2.728088
Dinner    3.102670
Name: tip, dtype: float64

In [25]:
# use sql to recreate this query
query = """SELECT time, AVG(tip) FROM tips GROUP BY time"""
c.execute(query).fetchall()

[('Dinner', 3.102670454545454), ('Lunch', 2.7280882352941176)]

We can also use `GROUP BY` with certain conditions, in conjunction with filtering and ordering.

In [27]:
tips.groupby(['size']).total_bill.mean()[2:]

size
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [24]:
# use pandas, get the average total bills for a party larger than 2 for every size of party
tips.groupby(['size']).total_bill.mean()[2:]

size
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [28]:
# use sql to recreate this query, hint use having or where
query = """SELECT size, AVG(total_bill) FROM tips GROUP BY size HAVING size > 2""" 
#"""SELECT size, AVG(total_bill) FROM tips WHERE size > 2 GROUP BY"""
c.execute(query).fetchall()

[(3, 23.27763157894737), (4, 28.61351351351351), (5, 30.068), (6, 34.83)]

In [29]:
# your turn - use pandas, get the maximum value of total bill for female non smoker
tips[(tips.sex == 'Female') & (tips.smoker == 'No')].total_bill.max()

35.83

In [48]:
# use sql to recreate this query
query = """SELECT MAX(total_bill) FROM tips WHERE sex = 'Female' and smoker = 'No' GROUP BY sex, smoker"""
c.execute(query).fetchall()

[(35.83,)]

In [49]:
# your turn - use pandas, get the average tip values for different size groups, and show top 2
# most amount of average tips
tips.groupby(['size']).tip.mean().sort_values(ascending = False)[:2]

size
6    5.225000
4    4.135405
Name: tip, dtype: float64

In [43]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [52]:
# use sql 
query = """SELECT size, AVG(tip) FROM tips GROUP BY size ORDER BY AVG(tip) DESC LIMIT 2"""
c.execute(query).fetchall()

[(6, 5.225), (4, 4.135405405405407)]

## Part II. Join

Based on this diagram, how would you explain the different types of joins?

<img src = 'sql-joins.png' width = 400>

In [53]:
print(small_grades)
print(small_quiz)

  students  quiz_score
0    Kevin           5
1       JP           4
2    Dipta           8
  students  projects  grades
0   Muriel         1      99
1       JP         2      92
2    Danny         1      91

In [54]:
# left join - join small quiz with small grades, on student name
small_grades.merge(small_quiz, on = 'students', how = "left")

# if i run this command, what would happen? how many observations/record?

  students  quiz_score  projects  grades
0    Kevin           5       NaN     NaN
1       JP           4       2.0    92.0
2    Dipta           8       NaN     NaN

In [55]:
# sql 
query = """SELECT * FROM small_grade LEFT JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

[(0, 'Kevin', 5, None, None, None, None),
 (1, 'JP', 4, 1, 'JP', 2, 92),
 (2, 'Dipta', 8, None, None, None, None)]

In [58]:
# inner join and get the student's grades
small_grades.merge(small_quiz, on = 'students', how = 'inner')

  students  quiz_score  projects  grades
0       JP           4         2      92

In [57]:
c.description

(('index', None, None, None, None, None, None),
 ('students', None, None, None, None, None, None),
 ('quiz_score', None, None, None, None, None, None),
 ('index', None, None, None, None, None, None),
 ('students', None, None, None, None, None, None),
 ('projects', None, None, None, None, None, None),
 ('grades', None, None, None, None, None, None))

In [59]:
query = """SELECT grades FROM small_grade INNER JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

[(92,)]

In [60]:
# your turn - use right join and get all entries
small_grades.merge(small_quiz, on = 'students', how = "right")
# pandas

  students  quiz_score  projects  grades
0       JP         4.0         2      92
1   Muriel         NaN         1      99
2    Danny         NaN         1      91

In [61]:
# sql 
query = """SELECT * FROM small_grade RIGHT JOIN small_quiz ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported